---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.ParameterValueNotDefined
source: html/f88641af-047c-6969-6283-b3b9528937e0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.ParameterValueNotDefined Property

Parameter assigned to the dimension has no value defined.

## Syntax (C#)
```csharp
public static FailureDefinitionId ParameterValueNotDefined { get; }
```